In [30]:
#groupby()메서드 사용 
from pandas import Series, DataFrame
import numpy as np 

df = DataFrame({'key1':['a','a','b','b','a'], 
                'key2':['one','two','one','two','one'], 
                'data1':np.random.randn(5), 
                'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.071537 -0.620173
1    a  two  0.452113 -0.540990
2    b  one  0.600085 -0.475811
3    b  two -0.493302  1.555679
4    a  one  0.049176  0.553688

In [31]:
grouped = df.groupby("key1")["data1"]
dfff = DataFrame(grouped)
print(dfff)
for key, group in grouped:
    print(key)
    print(group)

   0                                                  1
0  a  0   -0.071537
1    0.452113
4    0.049176
Name...
1  b  2    0.600085
3   -0.493302
Name: data1, dtype...
a
0   -0.071537
1    0.452113
4    0.049176
Name: data1, dtype: float64
b
2    0.600085
3   -0.493302
Name: data1, dtype: float64

In [32]:
print( grouped.mean() )
print( grouped.sum() )
print( grouped.count() )

key1
a    0.143251
b    0.053391
Name: data1, dtype: float64
key1
a    0.429752
b    0.106782
Name: data1, dtype: float64
key1
a    3
b    2
Name: data1, dtype: int64

In [33]:
means = df.groupby( ["key1","key2"] )["data1"].mean()
means

key1  key2
a     one    -0.011180
      two     0.452113
b     one     0.600085
      two    -0.493302
Name: data1, dtype: float64

In [34]:
from pandas import Series, DataFrame
import numpy as np 
#학급 성적 
dfClass = DataFrame({"학급":[1,1,2,2,1], 
                     "이름":["홍길동","전우치","이순신","박문수","김길동"],
                     "국어":[100,90,95,100,80], 
                     "영어":[80,90,95,92,89], 
                     "수학":[90,80,92,100,80]
                     })

dfClass

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
1   1  전우치   90  90   80
2   2  이순신   95  95   92
3   2  박문수  100  92  100
4   1  김길동   80  89   80

In [35]:
#합계
sum(dfClass["국어"])

465

In [38]:
#평균
sum(dfClass["국어"])/5

93.0

In [43]:
#오름차순
dfClass.sort_values(["학급", "수학"], ascending=[True, False])

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
1   1  전우치   90  90   80
4   1  김길동   80  89   80
3   2  박문수  100  92  100
2   2  이순신   95  95   92

In [25]:
#내림차순
dfClass.sort_values("국어", ascending=False)

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
3   2  박문수  100  92  100
2   2  이순신   95  95   92
1   1  전우치   90  90   80
4   1  김길동   80  89   80

In [46]:
#새로운 컬럼 추가하기
dfClass["전체"] = dfClass["국어"] + dfClass["수학"] + dfClass["영어"]

In [47]:
#평균을 추가하기 
dfClass["평균"] = (dfClass["국어"] + dfClass["수학"] + dfClass["영어"])/3

In [48]:
# dfClass
dfClass.sort_values(["학급", "평균"], ascending=[True, False])

   학급   이름   국어  영어   수학   전체         평균
0   1  홍길동  100  80   90  270  90.000000
1   1  전우치   90  90   80  260  86.666667
4   1  김길동   80  89   80  249  83.000000
3   2  박문수  100  92  100  292  97.333333
2   2  이순신   95  95   92  282  94.000000

In [13]:
#내림차순 정렬하기 
dfClass.sort_values("평균", ascending=False)

   학급   이름   국어  영어   수학   전체         평균
3   2  박문수  100  92  100  292  97.333333
2   2  이순신   95  95   92  282  94.000000
0   1  홍길동  100  80   90  270  90.000000
1   1  전우치   90  90   80  260  86.666667
4   1  김길동   80  89   80  249  83.000000

In [14]:
#학급별로 그룹핑하기 
dfClass.groupby("학급")["국어"].mean()

학급
1    90.0
2    97.5
Name: 국어, dtype: float64

In [55]:
#  집계합수 (agg) Aggregation 
df001 = dfClass.agg(수학평균=("수학","mean"))
df002 = dfClass.agg(수학총점=("수학","sum"))
pd.concat([df001, df002], axis=1)

NameError: name 'pd' is not defined

In [50]:
# 메소드 체인 - Linq와 유사
dfClass.groupby("학급").agg(수학평균=("수학","mean"))

         수학평균
학급
1   83.333333
2   96.000000

In [17]:
dfClass.groupby("학급").agg(국어평균=("국어","mean"), 
            수학평균=("수학","mean"),
            영어평균=("영어","mean"), 
            갯수=("학급","count"))

    국어평균       수학평균       영어평균  갯수
학급
1   90.0  83.333333  86.333333   3
2   97.5  96.000000  93.500000   2